---
kind: property
id: P:Autodesk.Revit.DB.SolidCurveIntersection.ResultType
source: html/eed17220-441d-07ee-11d9-9dfd7d84b792.htm
---
# Autodesk.Revit.DB.SolidCurveIntersection.ResultType Property

The result type used to calculate the intersections.

## Syntax (C#)
```csharp
public SolidCurveIntersectionMode ResultType { get; }
```